import 'dotenv/config';
import { drizzle } from 'drizzle-orm/neon-http';
import { article, usersTable } from './schema';
const db = drizzle(process.env.DATABASE_URL!);

const usersData = [
    {
        username: 'test1',
        password: '88888888'
    },
    {
        username: 'basbas',
        password: '88888888'
    }

]

const articleData = [
    {
        title: 'เปิดสูตรลับต้มไข่ เชฟดังใช้ "น้ำศักดิ์สิทธิ์" ที่ทุกบ้านมี ปอกเปลือกง่ายได้ไข่สวยเนียน!',
        description:'ปัญหาการปอกเปลือกไข่ต้มที่ยากลำบากและใช้เวลานานจะหมดไป ด้วยเคล็ดลับง่ายๆ ที่ช่วยให้การปอกเปลือกกลายเป็นเรื่องง่ายอย่างไม่น่าเชื่อ ทำให้ได้ไข่ต้มที่สวยงามน่ารับประทาน ไม่ต้องเจอกับเปลือกที่ติดแน่นจนเนื้อไข่ขาวแหว่งอีกต่อไป ไข่ต้มเป็นอาหารเช้าแบบคลาสสิกที่ได้รับความนิยม และสามารถนำไปใช้เพิ่มโปรตีนในสลัดหรืออาหารอื่นๆ ได้หลากหลายเมนู อย่างไรก็ตาม หลายคนมักประสบปัญหาการปอกเปลือกไข่ โดยเฉพาะอย่างยิ่งเมื่อเปลือกไข่มักจะติดแน่นกับเนื้อไข่ขาว ทำให้ไข่ที่ปอกออกมาไม่กลมสวยและดูไม่น่ากิน',
        imagePath: '/images/holywater.png',
        status: true,
    },

    {
    title: 'เปิดภาพชัด "แฮ็กเกอร์ตี" เจ็บอะไรถึงตัดสินใจถอนสู้ "นาบิล" ศึก ONE 173 ที่ญี่ปุ่น',
    description:'ต้องบอกว่าแฟนมวยผิดหวังไปตามๆ กัน เมื่อไฟต์เดิมพันเข็มขัดแชมป์โลก ONE มวยไทย รุ่นแบนตัมเวต ระหว่าง นาบิล อานาน กับ โจนาธาน\
        แฮ็กเกอร์ตี มีอันต้องยุติลง โดย นักชกชาวอังกฤษวัย 28 ปี ที่เดินทางมาเก็บตัวฝึกซ้อมอย่างหนักที่เกาะสมุย ได้ประกาศถอนตัวจากไฟต์ดังกล่าวหลังจากได้รับบาดเจ็บที่หัวไหล่จากการลงนวมฝึกซ้อม \
        แน่นอนงานนี้เจ้าตัวเสียใจเป็นอย่างมากหลังจากที่ก่อนหน้านี้มุ่งมั่นฝึกซ้อมอย่างหนักเพื่อไฟต์นี้โดยเฉพาะ ถึงขนาดที่หานักมวยรูปร่างสูงยาวเหมือน นาบิล มาเป็นคู่ซ้อม ซึ่งล่าสุด ONE ได้ออกมาประกาศเปลี่ยนคู่ชกเป็นที่เรียบร้อยโดย\
        นาบิล อานาน จะพบกับ ฮิโรมิ วาจิมะ นักชกชาวญี่ปุ่น ดีกรีอดีตแชมป์ K-1 รุ่นซูเปอร์เวลเตอร์เวต เจ้าของสถิติชนะ 22 ไฟต์จากทั้งหมด 28 ไฟต์ตลอดการชกระดับอาชีพ\
        สำหรับ ศึก ONE 173 จะจัดขึ้นที่สังเวียน อาริอาเกะ อารีนา กรุงโตเกียว ประเทศญี่ปุ่น ในวันอาทิตย์ที่ 16 พฤศิจกายนนี้'
        ,

    imagePath: 'images/boxing.png',
    status: true,
    },

]



async function seed() {
    console.log("clearing users table");
    await db.delete(usersTable);

    console.log("clearing article table");
    await db.delete(article);

    // ------------------------------------------------------------------------------------------------
    console.log("adding users tavle");
    for (const user of usersData) {
        await db.insert(usersTable).values(user);
    }
    console.log("adding article table")
    for (const a of articleData) {
        await db.insert(article).values(a);
    }


    console.log("✅ Seed completed.");
}

seed().catch((error) => {
    console.error("❌ Seed failed:", error);
    process.exit(1);
});

